announcements/x-environment-setup.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2015-09-21 Mon 09:10 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>Setting Up An X Environment For Using With Emacspeak, ChromeVox and StumpWM</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="raman" />
</head>
<body>
<div id="content">
<h1 class="title">Setting Up An X Environment For Using With Emacspeak, ChromeVox and StumpWM</h1>
<div id="outline-container-orgheadline4" class="outline-2">
<h2 id="orgheadline4"><span class="section-number-2">1</span> Executive Summary</h2>
<div class="outline-text-2" id="text-1">
<p>
This is a follow-up to <a href="http://tvraman.github.io/emacspeak/blog/stumpwm-setup.html">the article on my Window Manager </a>
and details the setup of my X environment. This setup is specifically geared around the following use-cases:
</p>

<ol class="org-ol">
<li>Emacspeak running in a window to provide a local audio desktop.</li>
<li>ChromeVox running in a second window to provide access to JS-powered WebApps. Note  that for the content-oriented Web, I  use Emacs' built-in EWW browser.</li>
<li>SSH running in an XTerm to my remote Linux desktop  in a third window. The remote desktop runs Emacspeak and produces  auditory feedback through a local speech server.</li>
</ol>

<p>
The setup described below is implemented via my personal <code>.XResources</code>
file &#x2014; that file along with my <code>.xsession</code> file that loads it are
both checked into the GitHub repo under <code>emacspeak/stumpwm</code>.
</p>

<p>
The remaining sections give a brief descriptive overview of the
<code>.XResources</code> and <code>.xsession</code> files as they exist  at the time of
writing.
</p>
</div>


<div id="outline-container-orgheadline1" class="outline-3">
<h3 id="orgheadline1"><span class="section-number-3">1.1</span> Resulting Functionality: What This Gives  Us</h3>
<div class="outline-text-3" id="text-1-1">
<ol class="org-ol">
<li>You can cut-and-paste between the local Chrome and local Emacspeak using standard clipboard copy/paste commands. Make sure Emacs is set up to use the clipboard, and not the primary X selection.</li>
<li>Output displayed in the Xterm, e.g., by the remote Emacspeak session, can be brought into the local Emacspeak session by hitting <code>PrintEverything</code> bound to <code>Ctrl-Return</code> in the XTerm window.</li>
<li>Contents of  the local clipboard, i.e. Chrome, Emacspeak etc., can be pasted into the remote Emacspeak  running in the XTerm using key <code>Ctrl-Shift-Space</code>.</li>
</ol>
</div>
</div>


<div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2"><span class="section-number-3">1.2</span> Initializing X Session Via File <code>.xsession</code></h3>
<div class="outline-text-3" id="text-1-2">
<pre class="example">
#!/bin/sh
#Caps Lock is Control
setxkbmap -option ctrl:nocaps       
#load in XResources to customize X environment 
xrdb -merge $HOME/.Xresources &amp;
#Display locks after  30 minutes of inactivity
xautolock -detectsleep -time 30  -locker  "$HOME/bin/xlock" &amp; 
# Launch Emacs 
emacs  -title Emacs &amp;
# XTerm for SSH to remote desktop
xterm  -title Retriever &amp;
# StumpWM Setup: Use SBCL 
export LISP=sbcl
# Export our  X auth environment 
${HOME}/bin/export_x_info &amp;
# Launch StumpWM
exec  /usr/local/bin/stumpwm
</pre>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3"><span class="section-number-3">1.3</span> Customizing X Environment Via File <code>.XResources</code></h3>
<div class="outline-text-3" id="text-1-3">
<pre class="example">
! Setup Emacs Visual Look And Feel
Emacs*font:     -adobe-Utopia-normal-normal-normal-*-*-*-*-*-*-0-iso10646-1
Emacs.FontBackend:      xft,x
Emacs.menuBar:  off
Emacs.toolBar:  off
Emacs.verticalScrollBars:       off
</pre>
<p>
:! Setup XTerm Look And Feel:
</p>

<pre class="example">
XTerm*Background:       black
XTerm*Foreground:       white
! Setup XTerm key-bindings to match Emacspeak
XTerm*VT100.translations:       #override \n\
Ctrl &lt;Key&gt;semicolon: string(0x18) string("@h") \n\
Ctrl &lt;Key&gt;comma: string(0x18) string("@a") \n\
Ctrl &lt;Key&gt;period: string(0x18) string("@s") \n\
Ctrl &lt;Key&gt;apostrophe: string(0x18) string("@s") \n\
Shift &lt;Key&gt;Return: string(0x18) string("@s") string(0x0d)\n\
Ctrl &lt;Key&gt;Return: print-everything()\n\
Ctrl Shift &lt;Key&gt;space:    insert-selection(CLIPBOARD) 
</pre>
<p>
:! Configure rest of XTerm 
</p>
<pre class="example">
XTerm*eightBitInput:    false
XTerm*faceName: xft:Inconsolata:pixelsize=14
XTerm*metaSendsEscape:  true
</pre>

<pre class="example">
! emacs-pipe.pl is under emacspeak/etc in the Emacspeak Git Repository
! This helps us view XTerm output in a buffer in the locally running Emacspeak
</pre>

<pre class="example">
XTerm.*.printerCommand:     /usr/local/bin/emacs-pipe.pl
XTerm.*.printAttributes: 0
</pre>

<pre class="example">
!X Font environment
Xft*antialias:  true
Xft*dpi:        96
Xft*hinting:    true
Xft*hintstyle:  hintfull
Xft*rgba:       rgb
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: <span class="timestamp-wrapper"><span class="timestamp">&lt;2015-09-21 Mon&gt;</span></span></p>
<p class="author">Author: raman</p>
<p class="date">Created: 2015-09-21 Mon 09:10</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
